---
kind: method
id: M:Autodesk.Revit.DB.VertexPair.Dispose
source: html/aed23447-7a90-6ea1-6a8b-415005c770ad.htm
---
# Autodesk.Revit.DB.VertexPair.Dispose Method

Releases all resources used by the VertexPair

## Syntax (C#)
```csharp
public void Dispose()
```